{"_id":{"$oid":"5bca7cbb243be00a0989ac3b"},"author":"OhSheGlows.com (Angela)","displayResponse":null,"ingredients":"~1 batch All-Purpose Cheese Sauce\n~14 ounces (400 g) fusilli or rotini pasta (about 4 1/2 cups dry pasta)\n~2 tablespoons (30 mL) extra-virgin olive oil\n~1 medium sweet onion, diced (about 2 cups/280 g)\n~3 large garlic cloves, minced\n~1 (8-ounce/255 g) package sliced cremini mushrooms*\n~1 teaspoon dried oregano**\n~1 teaspoon dried basil**\n~1 teaspoon dried thyme**\n~3 cups (750 mL) chunky marinara sauce***\n~One (14-ounce/398 mL) can lentils, drained and rinsed (about 1 1/2 cups)\n~2 tablespoons (30 mL) runny tahini\n~1/4 to 3/4 teaspoon fine sea salt, to taste\n~1/2 teaspoon freshly ground black pepper\n~1/2 teaspoon red pepper flakes (optional)\n~1 to 2 cups (40 to 80 g) stemmed and finely chopped kale ~(optional)\n~Paprika, for garnish\n~Cashew-Garlic Parmesan, for garnish","preparations":"~1. Oil a very large casserole dish (approx. 10\" x 14\") and set aside. Preheat the oven to 400°F (200°C).\nPrepare the cheese sauce. While the potatoes and carrots simmer for the cheese sauce, start on steps 3 and 4.\nBring a large pot of water to a boil and cook the pasta according to package instructions. Be sure not to overcook it. Drain and set aside.\n~2. Meanwhile, in a large dutch oven or pot (about 5 quarts), add the oil, onion, and garlic. Stir and add a pinch of salt. Sauté over medium heat for about 3 to 5 minutes, until the onion is softened and translucent.\nStir in the mushrooms, oregano, basil, and thyme, and cook for another 7 to 9 minutes over medium-high heat until the water cooks off.\n~3. Add the marinara sauce, drained lentils, and tahini. Stir until combined. Now add the cooked pasta and continue stirring until it’s coated in the lentil-veggie mixture.\nTaste and season with salt, pepper, and red pepper flakes (if using). Stir in the kale, if desired. Turn off the heat.\nSpoon all of the pasta mixture into the prepared casserole dish and spread it out evenly.\n~4. Pour the cheese sauce over top and spread it out with the back of a spoon until it covers the entire surface. Garnish with paprika (it adds a beautiful pop of red), more herbs, and black pepper, if desired.\n~5. Bake the casserole uncovered for 15 to 20 minutes, until heated through. (If you’re baking the casserole straight from the fridge, bake it for 25 to 30 minutes as it’ll take longer to heat up). Serve immediately with a generous sprinkle of Cashew-Garlic Parmesan on top of each portion. Leftovers can be refrigerated in an airtight container for up to 5 days. The leftovers are just as delicious chilled!","title":"Cheesy Lentil Bolognese Casserole"}
{"_id":{"$oid":"5bca8d777302e11ef4dafa5d"},"author":"OhSheGlows.com (Angela)","displayResponse":null,"ingredients":"~For the curry:\n~1 tablespoon (15 mL) extra-virgin olive oil\n~1 (14-ounce/398 mL) can light coconut milk\n~1 (14-ounce/398 mL) can diced tomatoes, with juices*\n~2 cups (260 g) chopped cauliflower florets (1-inch pieces)\n~2 cups (340 g) peeled and cubed (3/4-inch) butternut squash\n~1/2 cup (100 g) uncooked red lentils\n~2 tablespoons (30 mL) red curry paste**\n~1 teaspoon (7.5 mL) dried flaked onion***\n~1/2 teaspoon (2.5 mL) garlic powder\n~3/4 teaspoon fine sea salt, or to taste\n~1/4 teaspoon cayenne pepper\n~Lots of freshly ground black pepper, to taste\n~2 cups (75 g) packed stemmed and finely chopped kale or ~chard\n~Serving suggestions:\n~Cooked jasmine rice or grain of choice\n~Fresh chopped cilantro leaves\n~Fresh lime juice","preparations":"~1. First, add the oil and coconut milk to an Instant Pot. Now, add the rest of the curry ingredients (except the kale/chard) and stir until combined. I like to press down on the veggies and lentils to ensure they are completely covered in liquid.\nSecure lid in the lock position and check that the Steam Release Handle is pointing to the “Sealing” position.\nPress the “Pressure Cook” button (or “Manual”, on some machines) and set the cook time to 5 minutes on high pressure. After 5 seconds you’ll hear a couple beeps and the screen will say “on”. The cooking process has begun! You can now go do something fun for about 10 to 15 minutes while the curry cooks.\n~2. You’ll hear a few beeps when the timer is up. Immediately do a “Quick Pressure Release” to avoid overcooking the curry. I stand back and use a wooden spoon handle (never my hand!) to shift the Steam Release Handle to the “Venting” position to release the pressure. Once all of the pressure has been released, the float valve will sink and you won’t hear steam anymore.\n~3. Carefully open the lid and stir the curry. To achieve a thicker texture, I like to mash a bit of the curry with a potato masher, simply pulsing about 4 or 5 times around the pot. You can also blitz it for a second or two with an immersion blender.\n~4. Stir in the chopped greens until thoroughly combined and secure the lid. Set the Instant Pot to the “Keep Warm” setting and allow the greens to wilt for about 5 minutes in the curry. Press “Cancel” to turn the heat off and release the steam again, if necessary, before removing the lid.\nServe over rice or grain of choice, if desired, and garnish with cilantro and lime. The lime juice gives it a lovely brightness, but avoid using too much as it can overpower. I always add a sprinkle of salt and pepper before serving too.","title":"Instant Pot Cauliflower and Butternut Thai Curry"}
{"_id":{"$oid":"5bca8f7eeece6221df4e4f92"},"author":"OhSheGlows.com (Angela)","displayResponse":null,"ingredients":"~For the enchiladas:\n~2 cups (260 grams) peeled and chopped (1/2-inch dice) sweet potato\n~1 tablespoon plus 1 teaspoon extra-virgin olive oil\n~1 medium red onion, diced (2 to 2 1/2 cups)\n~3 large garlic cloves, minced\n~1 cup jarred roasted red pepper, drained and chopped\n~1/2 cup oil-packed sun-dried tomatoes, drained and finely chopped\n~2 cups baby spinach, roughly chopped\n~1 (14-ounce) can black beans (about 1 1/2 cups), drained and rinsed\n ~2 1/2 cups Homemade Enchilada Sauce (1 batch)\n~1 tablespoon fresh lime juice\n~1 teaspoon chili powder\n~1 teaspoon ground cumin\n~1/2 teaspoon fine sea salt, or to taste\n~5 to 6 medium/large soft tortilla wraps\n~For the toppings:\n~Cilantro-Lime-Garlic Cashew Cream\n~Chopped green onion, red pepper flakes, avocado, and cilantro","preparations":"~1. Prepare the Homemade Enchilada Sauce and soak the cashews for the Cilantro-Lime-Garlic Cashew Cream before you begin.\n~2. Lightly grease a large rectangular baking dish (at least 8x12 inches). Set aside.\n~3. Add the chopped sweet potato into a medium pot of water and bring to a boil. Reduce heat and simmer for 9 to 15 minutes, uncovered, until fork tender. Drain and set aside. You can also steam the potatoes until tender, instead of boiling.\n~4. In a large skillet, stir together the oil, onion, and garlic and sauté over medium heat for around 3 to 5 minutes until the onion softens. Season with a pinch of salt and pepper.\nPreheat the oven to 350°F.\n~5. Add the chopped roasted peppers, sun-dried tomatoes, cooked/drained sweet potato, spinach, and black beans. Cook for 3 to 5 minutes over medium-high heat, until the spinach is wilted.\n~6. Stir in 1/4 cup plus 2 tablespoons of homemade enchilada sauce, followed by the lime juice, chili powder, cumin, and salt. Adjust seasonings to taste, if desired.\n~7. Add 3/4 cup of Enchilada Sauce onto the bottom of your casserole dish and spread it out evenly.\n~8. Scoop 3/4 cup of the sweet potato and black bean filling onto each tortilla. Roll up the tortilla and place it, seam side down, in the casserole dish. Repeat for the rest. If you have any leftover filling, you can spread it on top of the tortillas. Spread all of the remaining enchilada sauce on top of the tortillas until they are completely covered in sauce.\n~9. Bake the enchiladas, uncovered, at 350⁰F for 20 to 25 minutes, until the sauce is a deep red colour and the enchiladas are heated through.\n~10. While the enchiladas are baking, prepare the Cilantro-Lime-Garlic Cashew Cream.\n~11. When enchiladas are ready to serve, add half of the cashew cream into a baggie, snip off the corner, and “pipe” the sauce all over the enchiladas. Alternatively, you can simply spread or dollop the sauce on top of each enchilada. Garnish with chopped cilantro, avocado, red pepper flakes, and green onion. Serve any remaining cashew cream on the side with a spoon.","title":"Next Level Vegan Enchiladas"}
